In [1]:
import pandas as pd

In [2]:
twod_array = [[0,1,2], [3,4,5]]

In [3]:
pd.DataFrame(twod_array)

   0  1  2
0  0  1  2
1  3  4  5

In [4]:
dic_arr = {'a' : [1,2,3], 'b' : [4,5,6]}

In [5]:
pd.DataFrame(dic_arr)

   a  b
0  1  4
1  2  5
2  3  6

In [6]:
list_arr = {'a' : ['Tokyo','Kanagawa','Chiba'], 'b' : ['Saitama','Tochigi','Ibaraki']}

In [7]:
pd.DataFrame(list_arr)

          a        b
0     Tokyo  Saitama
1  Kanagawa  Tochigi
2     Chiba  Ibaraki

In [8]:
tup_arr = {'a' : (1,2,3), 'b' : (4,5,6)}

In [9]:
pd.DataFrame(tup_arr)

   a  b
0  1  4
1  2  5
2  3  6

In [10]:
mix_dic = {'a' : [1,2,3], 'b' : ['a','b','c'], 'c' : (4,5,6)}

In [11]:
pd.DataFrame(mix_dic)

   a  b  c
0  1  a  4
1  2  b  5
2  3  c  6

In [14]:
import numpy as np

In [15]:
numpy_array = np.array([[1.5, 0], [0, 3.0]])

In [16]:
pd.DataFrame(numpy_array)

     0    1
0  1.5  0.0
1  0.0  3.0

In [17]:
state = pd.Series(['Tokyo', 'Osaka', 'Aichi', 'Hiroshima', 'Fukuoka'])

In [18]:
population = pd.Series([13515, 8839, 7483, 2644, 5102])

In [19]:
num_household = pd.Series([6691, 3918, 3060, 1209, 2197])

In [20]:
statistic = pd.DataFrame({
    'state' : state,
    'population' : population,
    'num_household' : num_household
})

In [21]:
statistic

       state  population  num_household
0      Tokyo       13515           6691
1      Osaka        8839           3918
2      Aichi        7483           3060
3  Hiroshima        2644           1209
4    Fukuoka        5102           2197

In [24]:
statistic_dict = {
    'population' : {'Tokyo' : 13515, 'Osaka' : 8839, 'Aichi' : 7483, 'Hiroshima' : 2844, \
                   'Fukuoka' : 5102},
    'num_household' : {'Osaka' : 3918, 'Aichi' : 3060, 'Tokyo' : 6691, \
                      'Hiroshima' : 1209, 'Fukuoka' : 2197}
}

In [25]:
statistic_2 = pd.DataFrame(statistic_dict)

In [26]:
statistic_2

           population  num_household
Aichi            7483           3060
Fukuoka          5102           2197
Hiroshima        2844           1209
Osaka            8839           3918
Tokyo           13515           6691

In [27]:
pd.DataFrame([
    {'Tokyo' : 6691, 'Osaka' : 3918, 'Hiroshima' : 1209, 'Aichi' : 3060, \
     'Fukuoka' : 2197},
    {'Tokyo' : 13515, 'Osaka' : 8839, 'Hiroshima' : 2844, 'Aichi' : 7843, \
    'Fukuoka' : 5102}
], index = ['num_household', 'population'])

               Aichi  Fukuoka  Hiroshima  Osaka  Tokyo
num_household   3060     2197       1209   3918   6691
population      7843     5102       2844   8839  13515

In [29]:
pd.DataFrame([
    pd.Series([6691, 3918, 1209, 3060, 2197], 
              index = ['Tokyo', 'Osaka', 'Hiroshima', 'Aichi', 'Fukuoka']),
    pd.Series([13515, 8839, 2844, 7843, 5102], 
             index = ['Tokyo', 'Osaka', 'Hiroshima', 'Aichi', 'Fukuoka'])
], index = ['num_household', 'population'])

               Tokyo  Osaka  Hiroshima  Aichi  Fukuoka
num_household   6691   3918       1209   3060     2197
population     13515   8839       2844   7843     5102

In [30]:
pd.DataFrame([
    (6691, 3918, 1209, 3060, 2197),
    [13515, 8839, 2844, 7834, 5102]
], index = ['num_household', 'population'], \
columns = ['Tokyo', 'Osaka', 'Hiroshima', 'Aichi', 'Fukuoka'])

               Tokyo  Osaka  Hiroshima  Aichi  Fukuoka
num_household   6691   3918       1209   3060     2197
population     13515   8839       2844   7834     5102

In [31]:
statistic

       state  population  num_household
0      Tokyo       13515           6691
1      Osaka        8839           3918
2      Aichi        7483           3060
3  Hiroshima        2644           1209
4    Fukuoka        5102           2197

In [32]:
pd.DataFrame(statistic)

       state  population  num_household
0      Tokyo       13515           6691
1      Osaka        8839           3918
2      Aichi        7483           3060
3  Hiroshima        2644           1209
4    Fukuoka        5102           2197

In [33]:
df = pd.DataFrame({
    'a' : [1, 1, 0],
    'b' : [0, 1, 0]}, dtype = bool)

In [34]:
df

       a      b
0   True  False
1   True   True
2  False  False

In [ ]:
df = pd.DataFrame({
    'a' : [1, 1, 0],
    'b'
})